{
    "__version": 10,
    "training_method": "LORA",
    "model_type": "Z_IMAGE",
    "debug_mode": false,
    "debug_dir": "debug",
    "workspace_dir": "output_folder_onetrainer/z_image",
    "cache_dir": "cache",
    "tensorboard": false,
    "tensorboard_expose": false,
    "tensorboard_always_on": false,
    "tensorboard_port": 6006,
    "validation": false,
    "validate_after": 1,
    "validate_after_unit": "EPOCH",
    "continue_last_backup": false,
    "prevent_overwrites": false,
    "include_train_config": "NONE",
    "multi_gpu": false,
    "device_indexes": "",
    "gradient_reduce_precision": "FLOAT_32_STOCHASTIC",
    "fused_gradient_reduce": true,
    "async_gradient_reduce": true,
    "async_gradient_reduce_buffer": 100,
    "base_model_name": "Tongyi-MAI/Z-Image",
    "output_dtype": "BFLOAT_16",
    "output_model_format": "SAFETENSORS",
    "output_model_destination": "output_folder_onetrainer/z_image/save/your_lora_name.safetensors",
    "gradient_checkpointing": "ON",
    "enable_async_offloading": false,
    "enable_activation_offloading": false,
    "layer_offload_fraction": 0.0,
    "force_circular_padding": false,
    "compile": false,
    "concept_file_name": "/workspace/OneTrainer_config/z_concepts.json",
    "concepts": [
        {
            "path": "/workspace/image_dataset_here",
            "num_repeats": 5,
            "caption_extension": ".txt",
            "read_captions_from_filename": false,
            "enable_crop_jitter": true,
            "enable_random_flip": false,
            "resolution": 1024
        }
    ],
    "aspect_ratio_bucketing": true,
    "latent_caching": true,
    "clear_cache_before_training": true,
    "learning_rate_scheduler": "COSINE",
    "custom_learning_rate_scheduler": null,
    "scheduler_params": [],
    "learning_rate": 1.0,
    "learning_rate_warmup_steps": 100,
    "learning_rate_cycles": 1.0,
    "learning_rate_min_factor": 0.0,
    "epochs": 3,
    "batch_size": 1,
    "gradient_accumulation_steps": 2,
    "ema": "OFF",
    "ema_decay": 0.999,
    "ema_update_step_interval": 5,
    "dataloader_threads": 2,
    "train_device": "cuda",
    "temp_device": "cpu",
    "train_dtype": "FLOAT_32",
    "fallback_train_dtype": "FLOAT_32",
    "enable_autocast_cache": true,
    "only_cache": false,
    "resolution": "1024",
    "mse_strength": 1.0,
    "mae_strength": 0.0,
    "log_cosh_strength": 0.0,
    "huber_strength": 0.0,
    "huber_delta": 1.0,
    "vb_loss_strength": 1.0,
    "loss_weight_fn": "CONSTANT",
    "loss_weight_strength": 1.0,
    "dropout_probability": 0.0,
    "loss_scaler": "NONE",
    "learning_rate_scaler": "NONE",
    "clip_grad_norm": 1.0,
    "offset_noise_weight": 0.0,
    "perturbation_noise_weight": 0.0,
    "min_noising_strength": 0.0,
    "max_noising_strength": 1.0,
    "timestep_distribution": "SIGMOID",
    "noising_weight": 0.0,
    "noising_bias": 0.0,
    "timestep_shift": 1.0,
    "dynamic_timestep_shifting": false,
    "transformer": {
        "__version": 0,
        "model_name": "",
        "include": true,
        "train": true,
        "stop_training_after": 0,
        "stop_training_after_unit": "NEVER",
        "learning_rate": null,
        "weight_dtype": "FLOAT_32",
        "dropout_probability": 0.0,
        "train_embedding": true,
        "attention_mask": false,
        "guidance_scale": 1.0
    },
    "text_encoder": {
        "__version": 0,
        "model_name": "",
        "include": true,
        "train": false,
        "stop_training_after": 0,
        "stop_training_after_unit": "NEVER",
        "learning_rate": null,
        "weight_dtype": "FLOAT_32",
        "dropout_probability": 0.0,
        "train_embedding": false,
        "attention_mask": false,
        "guidance_scale": 1.0
    },
    "masked_training": false,
    "unmasked_probability": 0.1,
    "unmasked_weight": 0.1,
    "normalize_masked_area_loss": false,
    "layer_filter": "",
    "layer_filter_preset": "full",
    "layer_filter_regex": false,
    "peft_type": "LORA",
    "lora_model_name": "your_lora_name",
    "lora_rank": 16,
    "lora_alpha": 16.0,
    "lora_weight_dtype": "FLOAT_32",
    "lora_decompose": false,
    "lora_decompose_norm_epsilon": true,
    "lora_decompose_output_axis": false,
    "bundle_additional_embeddings": true,
    "optimizer": {
        "__version": 0,
        "optimizer": "PRODIGY_ADV",
        "stochastic_rounding": true,
        "decouple": true,
        "d_coef": 0.8,
        "use_bias_correction": true,
        "safeguard_warmup": true,
        "beta1": 0.9,
        "beta2": 0.99,
        "weight_decay": 0.01,
        "d_limiter": true,
        "split_groups": true,
        "split_groups_mean": true,
        "factored": true,
        "factored_fp32": true,
        "use_stableadamw": true,
        "weight_decay_by_lr": true,
        "rms_rescaling": true
    },
    "sample_definition_file_name": "empty_samples.json",
    "samples": null,
    "sample_after": 0,
    "sample_after_unit": "NEVER",
    "sample_skip_first": 0,
    "sample_image_format": "JPG",
    "samples_to_tensorboard": false,
    "non_ema_sampling": false,
    "backup_after": 0,
    "backup_after_unit": "NEVER",
    "rolling_backup": false,
    "rolling_backup_count": 3,
    "backup_before_save": false,
    "save_every": 1,
    "save_every_unit": "EPOCH",
    "save_skip_first": 0,
    "save_filename_prefix": "your_lora_name",
    "save_model_format": "SAFETENSORS"
}
